//求职,招聘
const WorkTime = {
    '1':'高中以下',
    '2':'高中',
    '3':'中专/技校',
    '4':'大专',
    '5':'本科',
    '6':'硕士',
    '7':'博士',
    '8':'MBA/EMBA',
    '9':'不限'
}
const Age = {
    '0':'不限',
    '1': '25岁以下',
    '2': '30岁以下',
    '3': '35岁以下',
    '4': '40岁以下',
    '5': '50岁以下',
    '6': '不限',
    '7': '45岁以下'
}
const Experience = {
    '1': '无工作经验',
    '2': '应届毕业生',
    '3': '1年以下工作经验',
    '4': '1 - 3年工作经验',
    '5': '3 - 5年工作经验',
    '6': '5 - 10年工作经验',
    '7': '10年以上工作经验',
    '8':'经验不限'
}
const Salary = {
    '1': '面议',
    '2': '1000以下',
    '3': '1000-2000元',
    '4': '2000-3000元',
    '5':'3000-5000元',
    '6': '5000-8000元',
    '7':'8000-12000元',
    '8':'12000-20000元',
    '9':'20000元以上'
}

const Times = {
    '1':'月',
    '2':'周',
    '3':'小时',
    '4':'次',
    '5':'件',
    '6':'日',
}
const Gender = {
    '0': '性别不限',
    '1': '性别男',
    '2': '性别女'
}
// 拼车
const Carpool = [{
    'tag':'拼车类型'
  },{
    'tag':'出发地'
  },{
    'tag':'目的地'
  },{
    'tag':'出发时间'
  },{
    'tag':'手机号'
  },{
    'tag':'车牌号'
  },{
    'tag':'人数/空位'
}]
const CarpoolType = {
    '3':'车找人',
    '4':'人找车',
    '5':'车找货',
    '6':'货找车'
}
/*户型*/ 
const House = [{
    'tag':'户型'
  },{
    'tag':'面积'
  },{
    'tag':'类型'
}]
module.exports = {
    WorkTime,
    Age,
    Experience,
    Salary,
    Times,
    Gender,
    Carpool,
    CarpoolType,
    House
}